OpenFOAM/couetteFlow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)		//0
    (50 0 0)		//1
    (50 1 0)		//2
    (0 1 0)		//3
    (0 0 0.1)		//4
    (50 0 0.1)		//5
    (50 1 0.1)		//6
    (0 1 0.1)		//7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (500 25 1) simpleGrading (1 1 1)
);

boundary
(
    leftSide
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    rightSide
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
